Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: This jacket isn't expensive, it's very cheap.
hi: यह जैकेट महंगा नहीं है, बहुत सस्ता है।

source: Fishes know how to swim.
hi: मछलियों को तैरना आता है।

source: Should I clean my room?
hi: क्या मैं कमरा साफ़ कर सकती हूँ?

source: Farmers sow seeds in the rainy season.
hi: किसान वसन्त के मौसम में बीज बोते हैं।

source: Can you teach me?
hi: क्या तुम मुझे सिखा सकते हो?

source: I'm thinking of going to Vancouver to meet relatives.
hi: मैं सोच रहा हूँ कि अगले हफ़्ते वैनकूवर जाकर रिश्तेदारों से मिलूँ।

source: Tell me, why do you want to do something like this?
hi: बोलो तुम ऐसा क्यों करना चाहते हो।

source: How was the weather yesterday?
hi: कल का मौसम कैसा था?

source: What was the weather like yesterday?
hi: कल का मौसम कैसा था?

source: Everyone but him can answer this question.
hi: उसके अलावा बाकी सब इस प्रश्न का उत्तर दे सकते हैं।

source: Weather's been strange the past few years.
hi: पिछले कुछ सालों से मौसम बहुत अजीब है।

source: I cried all night.
hi: मैं पूरी रात रोई।

source: He has a lot of work to do.
hi: उसके पास बहुत सारा काम है।

source: Motherfucker!
hi: माँचोद!

source: I believe he is an intelligent person.
hi: मेरे ख़याल से वह समझदार इनसान है।

source: She showed me her new car.
hi: उसने मुझे अपनी नई गाड़ी दिखाई।

source: Yesterday I went to the river to catch fish.
hi: मैं कल नदी किनारे मछलियाँ पकड़ने गया था।

source: He just had food, he cannot be hungry.
hi: उसने अभी अभी खाना खाया है, वह भूखा कतई नहीं को सकता।

source: I've made my decision.
hi: मैं फ़ैसला कर चुका हूँ।

source: I've made a decision.
hi: मैं फ़ैसला कर चुका हूँ।

source: I have decided.
hi: मैं फ़ैसला कर चुका हूँ।

source: I have made my decision.
hi: मैं फ़ैसला कर चुका हूँ।

source: Yes, let's.
hi: हाँ, चलो।

source: I got married five years ago on this very day.
hi: मेरी शादी पाँच साल पहले इसी दिन पर हुई थी।

source: We bought this car for 10200 rupees.
hi: हमने यह गाड़ी दस हज़ार दो सौ रुपए की ख़रीदी है।

source: Why didn't he come yesterday?
hi: वह कल क्यों नहीं आया?

source: Why didn't she come yesterday?
hi: वह कल क्यों नहीं आई?

source: His younger sister is a well-known TV star.
hi: उसकी छोटी बहन बहुत जानीमानी टीवी स्टार है।

source: His younger sister is a famous TV star.
hi: उसकी छोटी बहन बहुत प्रसिद्ध टीवी कलाकार है।

source: I don't have money, but I do have a dream!
hi: मेरे पास पैसे नहीं है, पर सपना है!

source: I still don't know.
hi: मुझे अभी भी नहीं पता।

source: I still don't know yet.
hi: मुझे अभी भी नहीं पता।

source: I still don't know, even now.
hi: मुझे अभी भी नहीं पता।

source: Swimming here is very dangerous.
hi: यहाँ तैरना बहुत ख़तरनाक है।

source: They succeeded in reaching the mountain summit, but had an accident when coming back down.
hi: वे पर्वत शिखर तक पहुँचने में सफ़ल रहे, पर लौट कर नीचे आने के समय दुर्घटना हो गई।

source: That's not a grasshopper. It's a locust!
hi: वह टिड्डा नहीं है, उड़ने वाला टिड्डा है!

source: Stop!
hi: रुको!

source: Thanks!
hi: धन्यवाद!

source: It's snowing.
hi: बरफ़ गिर रही है।

source: They were afraid of you.
hi: वे तुमसे डरते थे।

source: The train has arrived.
hi: रेलगाड़ी आई है।

source: Don't be disappointed.
hi: निराश मत हो।

source: This is your key.
hi: यह आपकी चाबी है।

source: It's no concern of mine.
hi: इससे मेरे कोई लेना-देना नहीं है।

source: That can't be Mary. She's in the hospital now.
hi: हो नहीं सकता कि वह मेरी हो, क्योंकि मेरी अभी हस्पताल में है।

source: I fully believe that you are innocent.
hi: मुझे पक्का विश्वास है कि तुम निर्दोश हो।

source: I can read English.
hi: मैं अंग्रेज़ी पढ़ सकता हूँ।

source: You should've seen the movie.
hi: तुम्हें फ़िल्म देखनी चहिए थी।

source: Come if you can.
hi: आ सको तो आना।

source: Would you like to eat something?
hi: क्या आप कुछ खाना चाहेंगे?

source: I've never met her, but I recognize her.
hi: मैं उसे पहचानता हूँ पर मैं उससे कभी मिला नहीं हूँ।

source: I've never met him, but I recognize him.
hi: मैं उसे पहचानता हूँ पर मैं उससे कभी मिला नहीं हूँ।

source: I have nothing to say on this matter.
hi: मुझे इस विषय पर कुछ नहीं कहना है।

source: Stamps aren't sold in this store.
hi: यहां डाक टिकटें नहीं बेची जातीं हैं।

source: I have been very busy lately.
hi: मैं हाल में काफ़ी व्यस्त रहा हूँ।

source: George Bush is the forty-first president of the United States of America.
hi: जॉर्ज बुश अमरीका का इकतालिसवा राष्ट्रपति है।

source: George Bush is the forty-first president of America.
hi: जॉर्ज बुश अमरीका का इकतालिसवा राष्ट्रपति है।

source: According to him, she is not coming.
hi: उसके हिसाब से वह नहीं आ रही।

source: Everybody likes him.
hi: उसे सब पसंद करते हैं।

source: Everyone likes him.
hi: उसे सब पसंद करते हैं।

source: Everybody likes her.
hi: उसे सब पसंद करते हैं।

source: Which house did you live in before?
hi: तुम पहले किस घर में रहते थे?

source: Smoking is prohibited in this room.
hi: इस कमरे में धूम्रपान करना मना है।

source: I don't know when she will come.
hi: मुझे नहीं पता वह कब आएगी।

source: Anderson is very scared of dogs.
hi: ऐनडर्सन कुत्तों से बहुत डरता है।

source: Anderson is very scared of the dogs.
hi: ऐनडर्सन कुत्तों से बहुत डरता है।

source: I have to see a dentist.
hi: मुझे दंत चिकित्सक से मिलना है।

source: Where do you want to go and spend your vacation?
hi: तुम छुट्टियाँ कहाँ जा कर बिताना चाहते हो?

source: The sound of the wind is scary. It feels like the sound of ghosts.
hi: हवा की आवाज़ बहुत डरावनी है, ऐसा लगता है कि भूतों की आवाज़ें है।

source: I feel nauseous.
hi: मुझे उल्टी आ रही है।

source: The snow that fell recently has coloured the mountain white, it is truly beautiful.
hi: हाल ही में गिरी हुई बरफ़ ने पहाड़ को सफ़ेद रंग दिया है, सच में बहुत ही सुंदर है।

source: We have a school holiday tomorrow.
hi: हमारी कल स्कूल की छुट्टी है।

source: He pulled strongly, but the old rock did not budge in the slightest.
hi: उसने ज़ोर लगाकर खींचा, पर वह पुराना पत्थर ज़रा सा भी नहीं हिला।

source: Do you have time on Tuesday?
hi: तुम्हारे पास मंगलवार को समय है क्या?

source: It was only when I heard his voice that I recognised him.
hi: मैंने उसकी आवाज़ सुनने के बाद ही उसे पहचाना।

source: It's gotten too late, I should go back.
hi: बहुत देर हो गई है, मुझे वापस जाना चहिए।

source: Have you cleaned your room or not?
hi: तुमने अपना कमरा साफ़ किया है कि नहीं?

source: I don't want it.
hi: मुझे नहीं चाहिए।

source: He has three daughters.
hi: उसकी तीन बेटियाँ हैं।

source: Is his father a teacher?
hi: क्या उसके पिता शिक्षक हैं?

source: The pollution worsens with each year.
hi: प्रदूषण हर साल बदतर होता जाता है।

source: Happy birthday!
hi: जन्मदिन मुबारक हो!

source: Here are our books.
hi: यह रहे हमारे किताब।

source: Will he come tomorrow?
hi: वह कल आएगा क्या?

source: How many students are there in your class?
hi: तुम्हारी कक्षा में कितने विद्यार्थी हैं?

source: Where is the tea with milk?
hi: दूध वाली चाय कहाँ है?

source: After Saturday comes Sunday.
hi: शनिवार के बाद रविवार आता है।

source: Could I please use your phone?
hi: मैं आपका फ़ोन इस्तेमाल कर सकता हूँ क्या?

source: I would like to meet his father.
hi: मैं उसके पिता से मिलना चाह्ता हूँ।

source: Don't open your book.
hi: अपनी किताब मत खोलो।

source: My dad is not home at the moment.
hi: मेरे पापा इस वक़्त घर पर नहीं हैं।

source: You have to leave.
hi: तुम्हें जाना होगा।

source: Afterwards, I did not speak with them.
hi: उसके बाद, मैंने उनसे बात नहीं की।

source: Iron is a very useful metal.
hi: लोहा एक बहुत उपयोगी धातु है।

source: She told me that she wanted a pet dog.
hi: उसने मुझसे कहा कि उसे कुत्ता पालने का मन था।

source: These shoes are too big for me.
hi: ये जूते मेरे लिए बहुत बड़े हैं।

source: Who broke the vase?
hi: गुलदान को किसने तोड़ दिया?

source: He's a tennis player.
hi: वह टेनिस खिलाड़ी है।

source: Show me what's in your pocket.
hi: अपने जेब में क्या है दिखाओ।

source: Whatever you say, she is the one I'm going to marry.
hi: तुम जो भी कहो, मैं तो उससे ही शादी करूँगा।

source: She's not a doctor.
hi: वह डॉक्टर नहीं है।

source: Got it?
hi: समझे कि नहीं?

source: No one believed in his innocence.
hi: किसी ने भी उसके निर्दोष होने पर विश्वास नहीं किया।

source: I'm buying meat and vegetables.
hi: मैं गोश्त और सब्ज़ी खरीद रहा हूं।

source: Japan is close to China.
hi: जापान चीन के नज़दीक है।

source: Madrid is the capital of Spain.
hi: मेड्रिड स्पेन की राजधानी है।

source: Maria is sad today.
hi: मारिया आज उदास है।

source: May I come in?
hi: मैं अंदर आ सकता हूँ क्या?

source: My luggage is in the boot.
hi: मेरा सामान डिक्की में है।

source: My name is Henry.
hi: मेरा नाम हेनरी है।

source: None of the children are sitting.
hi: कोई भी बच्चा बैठा नहीं है।

source: See what's going on outside.
hi: देखो बाहर क्या हो रहा है।

source: She didn't give me my money back.
hi: उसने मुझे मेरे पैसे नहीं लौटाए।

source: Hungry?
hi: भूख लगी?

source: Do you come here every day?
hi: क्या आप यहाँ रोज़ आते हैं?

source: He was covered in mud from head to foot.
hi: वह सर से पांव तक कीचड़ में लतपत था।

source: It's mine, not his.
hi: मेरा है, उसका नहीं।

source: I wasn't fired. I quit.
hi: मुझे नौकरी से निकाला नहीं गया। मैंने खुद ही नौकरी छोड़ दी।

source: I am responsible for this mistake.
hi: इस ग़लती के लिए मैं ज़िम्मेदार हूँ।

source: The flowers have all withered.
hi: सारे फूल मुरझा गए हैं।

source: To go out half-naked is shameful.
hi: अधनंगे बाहर जाना बहुत शर्मदार होता है।

source: This problem is hard to solve.
hi: इस समस्या को सुलझाना बहुत कठिन है।

source: Do you think that fish can hear?
hi: क्या तुम्हें लगता है कि मछलियाँ सुन सकतीं हैं?

source: Maybe I am unhappy, but I don't intend to kill myself.
hi: हाँ शायद मैं दुखी हूँ, पर मुझे अपनी जान लेने का इरादा नहीं है।

source: Crazy!
hi: पागल!

source: French is his mother tongue.
hi: फ़्रांसीसी उसकी मातृ भाषा है।

source: What language is spoken in Mexico?
hi: मेक्सिको में कौनसी भाषा बोली जाती है?

source: He is one of my neighbors.
hi: वह मेरे पड़ोसियों में से एक है।

source: His son died last year.
hi: उसका बेटा पिछले साल मर गया।

source: I like each of them.
hi: मुझे हर एक पसंद है।

source: This is your dog.
hi: यह तुम्हारा कुत्ता है।

source: Shit.
hi: धत् तेरे की.

source: Shove a stick up your ass.
hi: डंडा घुसा अपनी गांड में।

source: Since you're here, you can help me.
hi: तुम यहाँ आ ही गए हो तो मेरी मदद कर सकते हो।

source: Soccer is very popular in Spain.
hi: फुटबॉल स्पेन में बहुत लोकप्रिय है।

source: Spanish is spoken here.
hi: यहाँ स्पेनी बोली जाती है।

source: Spanish is spoken in twenty countries.
hi: स्पेनी बीस देशों में बोली जाती है।

source: Stay there.
hi: वहीं रह।

source: Suck my dick.
hi: मरा लंड चूस।

source: The books are on the table.
hi: किताबें मेज़ पर हैं।

source: The capital of Mexico is the largest city in Latin America.
hi: मेक्सिको की राजधानी लैटिन अमरीका का सबसे बड़ा शहर है।

source: The horse is far from the house.
hi: घोड़ा घर से दूर है।

source: The kids are making too much noise.
hi: बच्चे कुछ ज़्यादा ही शोर कर रहे हैं।

source: The meat is not well enough cooked.
hi: मीट अच्छे से पका नहीं है।

source: The tea is hot.
hi: चाय गरम है।

source: There are many Roman statues in the next room.
hi: अगले कमरे में अनेक रोमन मूर्तियाँ हैं।

source: There are no towels in room 15.
hi: कमरा नम्बर पंद्राह में तौलिये नहीं हैं।

source: They are watching a movie.
hi: वे फ़िल्म देख रहे हैं।

source: They have black hair.
hi: उनके बाल काले हैं।

source: This chair is too small.
hi: यह कुरसी बहुत छोटी है।

source: This country is called Russia.
hi: इस देश को रूस कहते हैं।

source: This is my book.
hi: यह मेरी किताब है।

source: This isn't Spanish.
hi: यह स्पेनी नहीं है।

source: This museum has been closed for five years.
hi: यह म्युज़ियम पाँच साल से बंद है।

source: I cannot tolerate naughty children.
hi: मैं नटखट बच्चों को बर्दाश्त नहीं कर सकता।

source: To the south.
hi: दक्षिण की तरफ़।

source: Today I turn four years old.
hi: आज मैं चार साल का हो गया हूँ।

source: Today is September 1st.
hi: आज १ सितंबर है।

source: Turn left.
hi: बाएं मोड़ो।

source: We are from Columbia.
hi: हम कोलंबिया से हैं।

source: We can hear the church bell every morning.
hi: हमें हर सुबह चर्च की घंटी सुनाई देती है।

source: We study Arabic.
hi: हम अरबी पढ़तें हैं।

source: Weather changes often.
hi: मौसम अक्सर बदलता है।

source: Well done!
hi: शाबाश!

source: What do you like to do?
hi: तम्हे क्या करना अच्छा लगता है?

source: What do you want it for?
hi: तुम्हे किसलिए चाहिए?

source: What does it contain?
hi: इसमें क्या है?

source: What fruit is green?
hi: हरे रंग का कौनसा फल होता है?

source: What fruit is red?
hi: कौनसा फल लाल है?

source: Let him in.
hi: उसे अंदर भेजो।

source: Don't deceive him.
hi: उसे धोका मत दो।

source: French is her native language.
hi: फ़्रांसीसी उसकी मातृ भाषा है।

source: Where is your father?
hi: तुम्हारे पिता कहाँ हैं?

source: I was a fool to have tried explaining something to you that I don't understand myself.
hi: मैं अक्ल का मारा था जो तुम्हें वह समझाने की कोशिश करने बैठा जिसकी मुझे खुद ही समझ नहीं थी।

source: I had never seen him before.
hi: मैंने उसे पहले कभी नहीं देखा था।

source: I had met him many times before then.
hi: मैं उससे पहले कई बार मिल चुका था।

source: The pulao with meat is eight yuan. The vegetarian pulao is only four yuan.
hi: मांस वाला पुलाव आठ युएन का है। बिना मांस वाला पुलाव केवल चार युएन का है।

source: What's Tony doing?
hi: टोनी क्या कर रहा है?

source: He gave his life for the nation.
hi: उसने अपनी ज़िन्दगी अपने देश को प्रदान कर दी।

source: Please wait five minutes.
hi: कृपया पाँच मिनट ठहरिए।

source: Because of his advice, I was able to succeed.
hi: मैं उसकी सलाह की वजह से कामयाब हो गया।

source: Kiev is the mother of Russian cities.
hi: कीव रूसी शहरों की माँ है।

source: He is rich, but his older brother is poor.
hi: वह अमीर है, मगर उसका बड़ा भाई गरीब है।

source: One panini or two paninis?
hi: एक पानिनी या दो पानिनी?

source: Do you have breakfast at home?
hi: तुम घर में नाश्ता खाते हो क्या?

source: What is this fish called in English?
hi: इस मछली को अंग्रेज़ी में क्या कहते हैं?

source: She has blue eyes.
hi: उसकी नीली आँखें हैं।

source: Come over!
hi: आ जाओ!

source: He catches colds easily.
hi: उसे ज़ुकाम बहुत आसानी से हो जाता है।

source: Will we arrive in time?
hi: हम समय में पहुँच जाएँगे क्या?

source: How's your job going?
hi: तुम्हारी नौकरी कैसी चल रही है?

source: Why do you go about being cross at people?
hi: तुम लोगों पर इतना गुस्सा क्यों होते हो?

source: I'm going to go buy some materials today.
hi: मैं आज कुछ सामान ख़रीदने जाऊँगी।

source: We had three airplanes.
hi: हमारे पास तीन हवाई जहाज़ थे।

source: Oh! Show me how.
hi: अरे! मुझे भी सिखाओ!

source: I hope that it rains tomorrow.
hi: काश कल बारिश हो जाए।

source: Bad news travels quickly.
hi: बुरी खबर तेज़ी से फैलती है।

source: She knows nothing about your family.
hi: उसे तुम्हारे परिवार के बारे में कुछ नहीं पता.

source: Sir, I'm looking for a job.
hi: सर, मैं नौकरी ढूँढ रहा हूँ।

source: How much for half a kilo?
hi: आधा किलो कितने का है?

source: You're not preparing to leave, are you?
hi: तुम जाने की तैयारी नहीं कर रहे हो, है ना?

source: I play mahjong only now and then, because if I made a habit of it, I'd end up wasting all my time on it.
hi: माज्याँग मैं केवल कभी-कभार ही खेलती हूँ, क्योंकि अगर आदत लग गई तो सारा समय उसी पर बरबाद कर दूँगी।

source: Are you speaking to me?
hi: क्या आप मुझसे बात कर रहें हैं?

source: Where's the changing room?
hi: कपड़े बदलने का कमरा कहाँ पर है?

source: Education has nothing to do with age.
hi: शिक्षा से उम्र का कोई सम्बंध नहीं होता है।

source: I dove into the river.
hi: मैंने नदी में छलाँग लगाकर डुबकी ली।

source: There are five apples in this box.
hi: इस डब्बे में पाँच सेव हैं।

source: He killed that man.
hi: उसने उस आदमी को मार डाला।

source: I will explain it to him.
hi: मैं उसको यह बात समझाउँगा।

source: There's a lot of work to be done!
hi: बहुत सारा काम है करने को!

source: I have a lot of work to do!
hi: बहुत सारा काम है करने को!

source: We have a lot of work to do!
hi: बहुत सारा काम है करने को!

source: He is very smart.
hi: वह बहुत अकलमंद है।

source: My father hates the summer heat.
hi: मेरे पापा को गर्मी के मौसम से नफ़रत है।

source: I'm sorry, but the number you have dialled is incorrect.
hi: माफ़ कीजिएगा, आपने जो नम्बर डायल किया है वह ग़लत है।

source: He jumped into water without removing his clothes.
hi: उसने कपड़े उतारे बिना ही पानी में छलाँग लगादी।

source: Excuse me, is Xinqiao Restaurant far from here?
hi: सुनिए, शिनछिआओ रेस्तराँ यहाँ से दूर है क्या?

source: I haven't eaten yet.
hi: मैंने अभी तक नहीं खाया है।

source: Please sign here.
hi: यहाँ अपना हस्ताक्षर कीजिए।

source: I get up at six every day.
hi: मैं रोज़ छः बजे उठता हूँ।

source: Excuse me, is there a toilet nearby?
hi: सुनिए, आस-पास में कोई टॉयलेट है क्या?

source: It's five o' clock. If you quickly post your letter, it still might make it in time.
hi: पाँच बज गए हैं। अगर तुम अपनी चिट्ठी जल्दी से डाक में डालदो तो शायद अभी भी चली जाएगी।

source: It's good now; neither too heavy nor too light.
hi: अब ठीक है। न ज़्यादा भारी है न ज़्यादा हल्का है।

source: What day is it today?
hi: आज कौनसा वार है?

source: One of the lights is not working. Do you think you could come take a look?
hi: एक बत्ती नहीं जल रही है। तुम ज़रा आकर देख सकते हो क्या?

source: He employs a maid.
hi: वह नौकरानी रखता है।

source: His girlfriend is Japanese.
hi: उसकी गर्लफ़्रेंड जापानी है।

source: Pakistan is a Muslim country.
hi: पाकिस्तान मुस्लिम देश है।

source: No.
hi: नहीं।

source: Don't make noise.
hi: शोर मत मचाओ।

source: Yes.
hi: हाँ.

source: Yep.
hi: हाँ.

source: My god is the greatest!
hi: मेरा भगवान सबसे महान है.

source: I usually get up at eight o'clock.
hi: मैं आमतौर आठ बजे सोकर उठता हूँ।

source: Paraguay is a country in South America.
hi: पराग्वे दक्षिण अमेरिका में स्थित एक देश है।

source: The sun is red.
hi: सूरज लाल है।

source: Blah.
hi: बकवास.

source: Don't leave me!
hi: मुझे छोड़ के मत जाओ!

source: Someone has cut my kite string.
hi: किसी ने मेरी पतंग काट ली है।

source: Our health is our most precious possession.
hi: हमारा स्वास्थ्य हमारी सबसे कीमती संपत्ति होती है।

source: Look how fast he runs!
hi: देखो वह कितना तेज़ दौड़ता है!

source: Hindus and Muslims are all brothers.
hi: हिंदू-मुसलमान भाई-भाई।

source: Will you do as much as you are able to?
hi: क्या तुम जितना कर सकते हो उतना करोगे?

source: In Soviet Russia, sentence writes you!
hi: सोवियेत रूस में आप वाक्यों को नहीं वाक्य आपको लिखतें हैं।

source: Please sit.
hi: बैठिए।

source: The conference ended at five.
hi: यह सम्मेलन पाँच बजे खत्म हुआ।

source: Many people encouraged me to fulfill my ambitions.
hi: अपनी अभिलाषाओं को पूरी करने के लिए मुझे बहुत से लोगों ने बढ़ावा दिया।

source: Waking up is the opposite of going to sleep.
hi: जागना सोने का विलोम शब्द है।

source: You should be a little more sensible.
hi: तुम्हें थोड़ा ज़्यादा समझदार होना चाहिए।

source: Today is Independence Day.
hi: आज स्वतंत्रता दिवस है।

source: India's Independence Day is celebrated on the fifteenth of August.
hi: भारत का स्वतंत्रता दिवस पंद्रह अगस्त को मनाया जाता है।

source: Republic Day is celebrated on the twenty-sixth of January.
hi: छब्बीस जनवरी को गणतंत्र दिवस मनाया जाता है।

source: The power went out.
hi: बिजली चली गई।

source: On the fifteenth of August, thousands of people fly kites.
hi: पंद्रह अगस्त के दिन हज़ारों लोग पतंग उड़ातें हैं।

source: The Indian flag is called the tricolour because it has stripes of three colours – saffron, white and green.
hi: भारत का झंडा तिरंगा कहलाया जाता है क्योंकि उसमें तीन रंगों की पट्टियाँ हैं - केसरी, सफ़ेद और हरा।

source: It seems to me that you're wrong.
hi: मुझे लगता है कि तुम ग़लत हो।

source: He's in a bad state.
hi: उसकी हालत बुरी है।

source: This is the monsoon season.
hi: यह वर्षा ऋतु का मौसम है।

source: He has a lot of money.
hi: वह बहुत पैसेवाला है।

source: I'll phone you.
hi: मैं तुम्हें फ़ोन करूँगा।

source: He's not a scientist, but he is our friend.
hi: वोह एक वैज्ञानिक न ही है, पर हमारा दोस्त जरूर है |

source: Sumo wrestling is a traditional Japanese sport.
hi: सूमो कुश्ती यह एक पारंपरिक जापानी खेल है।

source: What is this nonsense?
hi: यह क्या बकवास है?

source: I'm really hungry.
hi: मुझे बहुत भूख लगी है।

source: She prepared a wonderful meal for us.
hi: उसने हमारे लिए बहुत ही शानदार भोजन तैयार किया।

source: He is her friend.
hi: वह उसका दोस्त है।

source: He is French.
hi: वह फ़्रानसीसी है।

source: Who doesn't know such a common saying?
hi: इस तरह की आम कहावत को कौन नहीं जानता?

source: This computer has a Pentium processor.
hi: इस कंप्यूटर में एक पेंटियम प्रोसेसर है।

source: Precisely!
hi: वही तो!

source: Guns don't kill people. People kill people.
hi: बंदूकें लोगों को नहीं मारती। लोग लोगों को मारते हैं।

source: Doctor, my name is Mutaz.
hi: डाक्टर, मेरा नाम मुताज़ है।

source: Can't you speak English?
hi: तुम अंग्रेज़ी नहीं बोल सकते हो क्या?

source: I never dreamed that I would meet you here.
hi: मैं सपने में भी नहीं सोच सकता था कि तुमसे यहाँ मुलाकात होगी।

source: I never dreamed that you would lose.
hi: मैंने सपने में भी नहीं सोचा था कि तुम हार जाओगे।

source: Would you mind speaking a little softer please?
hi: आवाज़ थोड़ी धीमी कर सकते हो क्या?

source: He could not come because of his illness.
hi: वह बीमारी की वजह से नहीं आ सका।

source: She could not come because of her illness.
hi: वह बीमारी की वजह से नहीं आ सका।

source: I just fixed the car yesterday!
hi: मैंने गाड़ी को कल ही तो ठीक किया था!

source: The room smelled of tobacco.
hi: कमरे में तम्बाकू की महक थी।

source: Trade leads to national progress.
hi: व्यापार से देश का विकास होता है।

source: Can't you see right?
hi: तुम्हारी आँखे खराब हैं क्या?

source: Place it wherever you like.
hi: जहाँ भी रखना है रखदो।

source: Insert it wherever you like.
hi: जहाँ भी घुसाना है घुसा दो।

source: Yesterday's maximum temperature was 37ºC.
hi: कल का अधिकतम तापमान सैंतीस डिग्री सेल्सियस था।

source: Respect yourself and you will be respected.
hi: अपनी मर्यादा अपने हाथ

source: Come sit with us.
hi: आओ हमारे साथ बैठो।

source: In Japan there aren't any lakes bigger than Lake Biwa.
hi: जापान में बीवा झील से बड़ी और कोई झील नहीं है।

source: Why don't you listen to me?
hi: तुम मेरी बात सुनते क्यों नहीं हो?

source: One language is never enough.
hi: एक भाषा कभी काफ़ी नहीं होती।

source: One language will never be enough.
hi: एक भाषा कभी भी काफ़ी नहीं होगी।

source: To have one's cake and eat it too.
hi: चित भी मेरी पट भी मेरी।

source: One more time.
hi: और एक बार।

source: Again.
hi: और एक बार।

source: From what you can tell, what subject would he have interest in?
hi: तुम्हारे हिसाब से उसे किस विषय में दिलचस्पी होगी?

source: France is in Western Europe.
hi: फ़्रान्स पश्चिमी यूरोप में है।

source: Yes, he's our manager.
hi: हाँ, हमारे मैनेजर हैं।

source: Yes, she's our manager.
hi: हाँ, हमारे मैनेजर हैं।

source: Yes, that's our manager.
hi: हाँ, हमारे मैनेजर हैं।

source: Fight the illness.
hi: बीमारी से लड़ना।

source: I did not reply to your letter as I was too busy.
hi: मैंने तुम्हारी चिट्ठी का जवाब नहीं दिया क्योंकि मैं बहुत बिज़ी था।

source: What's the problem?
hi: मुश्किल क्या है?

source: She will go abroad in six months.
hi: वह छः महीनों में विदेश चली जाएगी।

source: My throat has dried up.
hi: मेरा गला सूख गया है।

source: Don't say things like that.
hi: ऐसा मत बोलो।

source: I am dead to you.
hi: मैं तुम्हारी आँखों में मर चुका हूँ।

source: In your eyes, I am already dead.
hi: मैं तुम्हारी आँखों में मर चुका हूँ।

source: That accident was due to his carelessness.
hi: वह ऐक्सीडेंट उसकी लापरवाही की वजह से हुआ।

source: After you're done cutting up the vegetables, put them there. Don't know when I'll be back to cook them.
hi: सब्ज़ियाँ काटने के बाद वहाँ रख दो। पता नहीं इन्हें कब आ कर पकाऊँगी।

source: My brother has a good memory.
hi: मेरे भाई की याददाश्त अच्छी है।

source: Drink the medicine.
hi: दवाई पियो।

source: Are you a doctor?
hi: आप डॉक्टर हैं क्या?

source: Your dog is very fat.
hi: तुम्हारा कुत्ता बहुत मोटा है।

source: Don't speak nonsense!
hi: तुम बकवास मत करो!
